{"modelTopology": {"node": [{"name": "input_4", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, {"name": "dense_12/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_12/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_11/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_11/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_10/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_10/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "1024"}]}}}}}, {"name": "dense_9/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_9/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "global_average_pooling2d_4/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv1_bn/keras_learning_phase/input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "conv1_bn_3/Const_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13_bn_3/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "conv_pw_13_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn_3/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "conv_dw_13_3/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "1"}]}}}}}, {"name": "conv_pw_12_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1_pad_3/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv_pw_11_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_bn_3/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_pw_10_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10_bn_3/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_dw_10_bn_3/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_dw_10_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_3/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "conv_pw_8_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_bn_3/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_pw_7_3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "conv_dw_7_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_3/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "conv_pw_6_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_bn_3/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "conv_dw_5_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_bn_3/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "conv_pw_3_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_bn_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn_3/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "conv1_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_bn_3/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "conv_dw_2_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_bn_3/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "conv_dw_5_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_bn_3/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "conv_pw_5_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_bn_3/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "conv_dw_6_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_bn_3/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_pw_9_bn_3/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_dw_10_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13_bn_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13_bn_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn/keras_learning_phase", "op": "PlaceholderWithDefault", "input": ["conv1_bn/keras_learning_phase/input"], "attr": {"dtype": {"type": "DT_BOOL"}, "shape": {"shape": {}}}}, {"name": "conv1_pad_3/Pad", "op": "Pad", "input": ["input_4", "conv1_pad_3/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv1_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv1_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv1_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv1_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv1_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_1_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_1_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_1_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_1_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_1_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_1_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_1_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_1_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_2_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_2_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_2_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_2_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_2_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_2_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_2_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_2_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_3_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_3_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_3_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_3_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_3_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_3_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_3_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_3_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_4_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_4_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_4_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_4_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_4_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_4_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_4_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_4_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_5_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_5_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_5_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_5_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_5_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_5_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_5_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_5_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_6_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_6_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_6_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_6_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_6_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_6_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_6_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_6_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_7_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_7_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_7_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_7_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_7_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_7_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_7_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_7_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_8_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_8_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_8_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_8_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_8_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_8_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_8_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_8_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_9_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_9_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_9_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_9_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_9_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_9_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_9_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_9_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_10_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_10_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_10_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_10_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_10_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_10_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_10_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_10_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_11_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_11_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_11_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_11_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_11_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_11_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_11_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_11_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_12_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_12_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_12_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_12_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_12_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_12_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_12_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_12_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_dw_13_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_dw_13_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_dw_13_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_dw_13_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13_bn_3/cond/FusedBatchNorm/Switch_4", "op": "Switch", "input": ["conv_pw_13_bn_3/moving_variance", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13_bn_3/cond/FusedBatchNorm/Switch_3", "op": "Switch", "input": ["conv_pw_13_bn_3/moving_mean", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13_bn_3/cond/FusedBatchNorm/Switch_2", "op": "Switch", "input": ["conv_pw_13_bn_3/beta", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13_bn_3/cond/FusedBatchNorm/Switch_1", "op": "Switch", "input": ["conv_pw_13_bn_3/gamma", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv1_3/convolution", "op": "Conv2D", "input": ["conv1_pad_3/Pad", "conv1_3/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "conv1_bn_3/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["conv1_3/convolution", "conv1_bn_3/gamma", "conv1_bn_3/beta", "conv1_bn_3/Const_4", "conv1_bn_3/Const_4"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}}}, {"name": "conv1_bn_3/cond/FusedBatchNorm/Switch", "op": "Switch", "input": ["conv1_3/convolution", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn_3/cond/Switch_1", "op": "Switch", "input": ["conv1_bn_3/FusedBatchNorm", "conv1_bn/keras_learning_phase"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn_3/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["conv1_bn_3/cond/FusedBatchNorm/Switch", "conv1_bn_3/cond/FusedBatchNorm/Switch_1", "conv1_bn_3/cond/FusedBatchNorm/Switch_2", "conv1_bn_3/cond/FusedBatchNorm/Switch_3", "conv1_bn_3/cond/FusedBatchNorm/Switch_4"], "attr": {"data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}, "epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn_3/cond/Merge", "op": "Merge", "input": ["conv1_bn_3/cond/FusedBatchNorm", "conv1_bn_3/cond/Switch_1:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "conv1_relu_3/Relu6", "op": "Relu6", "input": ["conv1_bn_3/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_3/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv1_relu_3/Relu6", "conv_dw_1_3/depthwise_kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": 